t21/Walnut_X/Packages/.cache/Keil.EZR32WG_DFP.1.1.0.pdsc
        <!-- *************************  Device 'EZR32WG230F128R60'  ***************************** -->
        <device Dname="EZR32WG230F128R60">
          <compile header="Device/EZR32WG/Include/em_device.h"  define="EZR32WG230F128R60"/>
          <debug svd="SVD/EZR32WG/EZR32WG230F128R60.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32WG.FLM" start="0x00000000" size="0x00020000" default="1" RAMstart="0x20000000" RAMsize="0x8000"/>
        </device>

        <!-- *************************  Device 'EZR32WG230F256R60'  ***************************** -->
        <device Dname="EZR32WG230F256R60">
          <compile header="Device/EZR32WG/Include/em_device.h"  define="EZR32WG230F256R60"/>
          <debug svd="SVD/EZR32WG/EZR32WG230F256R60.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32WG.FLM" start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x8000"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EZR32WG230 R61'  **************************** -->
      <subFamily DsubFamily="EZR32WG230 R61">
        <book name="Documents/EZR32WG230_DataSheet.pdf" title="EZR32WG230 Data Sheet"/>

        <feature type="IOs"           n="41"                     name="General Purpose I/O pins"/>
        <feature type="ExtInt"        n="16"                     name="External Interrupts"/>
        <feature type="DMA"           n="12"                     name="Central DMA Controller"/>
        <feature type="Crypto"        n="128.256"                name="Advanced Encryption Standard (AES)"/>
        <feature type="SPI"           n="2"                      name="Serial Peripheral Interface (SPI)"/>
        <feature type="UART"          n="2"                      name="UART Interface"/>
        <feature type="UART"          n="2"                      name="Low Energy UART Interface"/>
        <feature type="I2C"           n="2"                      name="I2C Interface with SMBus support"/>
        <feature type="Timer"         n="4"        m="16"        name="Timer"/>
        <feature type="Timer"         n="1"        m="16"        name="Low Energy Timer"/>
        <feature type="Timer"         n="1"        m="24"        name="Real-Time Counter"/>
        <feature type="Timer"         n="1"        m="32"        name="Real-Time Counter"/>
        <feature type="TimerOther"    n="3"                      name="8/16-bit Pulse Counter"/>
        <feature type="WDT"           n="1"                      name="Watchdog Timer with dedicated RC oscillator"/>
        <feature type="RTC"           n="32768"                  name="Real Time Counter (RTC)"/>
        <feature type="ADC"           n="8"        m="12"        name="ADC"/>
        <feature type="DAC"           n="2"        m="12"        name="DAC"/>
        <feature type="TempSens"      n="1"                      name="Temperature Sensor"/>
        <feature type="AnalogOther"   n="3"                      name="Operational Amplifier"/>
        <feature type="AnalogOther"   n="2"                      name="Analog Comparator"/>
        <feature type="AnalogOther"   n="1"                      name="Supply Voltage Comparator"/>
        <feature type="Other"         n="1"                      name="Low Energy Sensor Interface (LESENSE)"/>
        <feature type="Other"         n="1"                      name="RF Module"/>
        <feature type="VCC"           n="1.98"     m="3.8"       name="Single supply voltage"/>
        <feature type="Temp"          n="-40"      m="85"        name="Extended Operating Temperature Range"/>
        <feature type="QFN"           n="64"                     name="QFN Package"/>

        <!-- *************************  Device 'EZR32WG230F64R61'  ***************************** -->
        <device Dname="EZR32WG230F64R61">
          <compile header="Device/EZR32WG/Include/em_device.h"  define="EZR32WG230F64R61"/>
          <debug svd="SVD/EZR32WG/EZR32WG230F64R61.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32WG.FLM" start="0x00000000" size="0x00010000" default="1" RAMstart="0x20000000" RAMsize="0x8000"/>
        </device>

        <!-- *************************  Device 'EZR32WG230F128R61'  ***************************** -->
        <device Dname="EZR32WG230F128R61">
          <compile header="Device/EZR32WG/Include/em_device.h"  define="EZR32WG230F128R61"/>
          <debug svd="SVD/EZR32WG/EZR32WG230F128R61.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32WG.FLM" start="0x00000000" size="0x00020000" default="1" RAMstart="0x20000000" RAMsize="0x8000"/>
        </device>

        <!-- *************************  Device 'EZR32WG230F256R61'  ***************************** -->
        <device Dname="EZR32WG230F256R61">
          <compile header="Device/EZR32WG/Include/em_device.h"  define="EZR32WG230F256R61"/>
          <debug svd="SVD/EZR32WG/EZR32WG230F256R61.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32WG.FLM" start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x8000"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EZR32WG230 R63'  **************************** -->
      <subFamily DsubFamily="EZR32WG230 R63">
        <book name="Documents/EZR32WG230_DataSheet.pdf" title="EZR32WG230 Data Sheet"/>

        <feature type="IOs"           n="41"                     name="General Purpose I/O pins"/>
        <feature type="ExtInt"        n="16"                     name="External Interrupts"/>
        <feature type="DMA"           n="12"                     name="Central DMA Controller"/>
        <feature type="Crypto"        n="128.256"                name="Advanced Encryption Standard (AES)"/>
        <feature type="SPI"           n="2"                      name="Serial Peripheral Interface (SPI)"/>
        <feature type="UART"          n="2"                      name="UART Interface"/>
        <feature type="UART"          n="2"                      name="Low Energy UART Interface"/>
        <feature type="I2C"           n="2"                      name="I2C Interface with SMBus support"/>
        <feature type="Timer"         n="4"        m="16"        name="Timer"/>
        <feature type="Timer"         n="1"        m="16"        name="Low Energy Timer"/>
        <feature type="Timer"         n="1"        m="24"        name="Real-Time Counter"/>
        <feature type="Timer"         n="1"        m="32"        name="Real-Time Counter"/>
        <feature type="TimerOther"    n="3"                      name="8/16-bit Pulse Counter"/>
        <feature type="WDT"           n="1"                      name="Watchdog Timer with dedicated RC oscillator"/>
        <feature type="RTC"           n="32768"                  name="Real Time Counter (RTC)"/>
        <feature type="ADC"           n="8"        m="12"        name="ADC"/>
        <feature type="DAC"           n="2"        m="12"        name="DAC"/>
        <feature type="TempSens"      n="1"                      name="Temperature Sensor"/>
        <feature type="AnalogOther"   n="3"                      name="Operational Amplifier"/>
        <feature type="AnalogOther"   n="2"                      name="Analog Comparator"/>
        <feature type="AnalogOther"   n="1"                      name="Supply Voltage Comparator"/>
        <feature type="Other"         n="1"                      name="Low Energy Sensor Interface (LESENSE)"/>
        <feature type="Other"         n="1"                      name="RF Module"/>
        <feature type="VCC"           n="1.98"     m="3.8"       name="Single supply voltage"/>
        <feature type="Temp"          n="-40"      m="85"        name="Extended Operating Temperature Range"/>
        <feature type="QFN"           n="64"                     name="QFN Package"/>

        <!-- *************************  Device 'EZR32WG230F64R63'  ***************************** -->
        <device Dname="EZR32WG230F64R63">
          <compile header="Device/EZR32WG/Include/em_device.h"  define="EZR32WG230F64R63"/>
          <debug svd="SVD/EZR32WG/EZR32WG230F64R63.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32WG.FLM" start="0x00000000" size="0x00010000" default="1" RAMstart="0x20000000" RAMsize="0x8000"/>
        </device>

